<?php

function trans_currency()
{
    return [
        'GBP' => '英镑',
        'HKD' => '港币',
        'USD' => '美元',
        'SGD' => '新加坡元',
        'JPY' => '日元',
        'CAD' => '加拿大元',
        'AUD' => '澳元',
        'EUR' => '欧元',
        'NZD' => '新西兰元',
        'KRW' => '韩元',
        'THB' => '泰铢',
        'CHF' => '瑞士法郎',
        'SEK' => '瑞典克朗',
        'DKK' => '丹麦克朗',
        'NOK' => '挪威克朗',
        'MYR' => '马来西亚林吉特',
        'IDR' => '印尼卢比',
        'PHP' => '菲律宾比索',
        'MUR' => '毛里求斯卢比',
        'ILS' => '以色列新谢克尔',
        'LKR' => '斯里兰卡卢比',
        'RUB' => '俄罗斯卢布',
        'AED' => '阿联酋迪拉姆',
        'CZK' => '捷克克朗',
        'ZAR' => '南非兰特',
        'CNY' => '人民币',
    ];
}
